# -*- coding: utf-8 -*-


class ErrorCode(object):
    """
    错误码及错误信息.
    """

    error_request_num_limit = {
        100101: "调用次数不够,请充值",
        100104: "服务每天调用量超限",
        100203: "无效的apikey",
        100205: "api已经关闭",
    }

    error_4xx = {
        100201: "url无法解析",
        100208: "请求方式不支持",
        200201: "传进参数为空",
        200500: "内容长度不能超过2000个字符",
    }

    error_5xx = {
        100102: "服务每秒调用量超限",
        100103: "服务每小时调用量超限",
        100206: "服务商响应status非200",
        100207: "服务商未正确接入",
        100301: "Api商城内部错误",
        100302: "请求服务商过程中错误",
        100303: "系统繁忙稍候再试",
        200107: "服务器异常或超时",
    }
